; domain
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
;; Reference paper: Scala, Enrico, Patrik Haslum, Sylvie Thiébaux, and Miquel Ramirez. 
;;                  "Subgoaling techniques for satisficing and optimal numeric planning." 
;;                  Journal of Artificial Intelligence Research 68 (2020): 691-752.
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; The Farmland domain models allocating manpower to farms, with a 
;; hard constraint on a metric measuring benefit. The contribution of
;; each farm to the benefit is a function of the number of workers assigned
;; Each farm requires at least one worker
(define (domain farmland)
    (:types farm - object)
    (:predicates (adj ?f1 ?f2 - farm))
    (:functions
        (x ?b - farm)
        (cost)
    )

    ;; Move a person from a unit f1 to a unit f2
    (:action move-fast
        :parameters (?f1 ?f2 - farm)
       :precondition (and (not (= ?f1 ?f2)) (>= (x ?f1) 4) (adj ?f1 ?f2) )
      :effect (and(decrease (x ?f1) 4) (increase (x ?f2) 2) (increase (cost) 1))
    )
    
    (:action move-slow
         :parameters (?f1 ?f2 - farm)
         :precondition (and (not (= ?f1 ?f2)) (>= (x ?f1) 1) (adj ?f1 ?f2))
         :effect (and(decrease (x ?f1) 1) (increase (x ?f2) 1))
    )

)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_16_14)
	(:domain farmland)
	(:objects
		farm0  farm1  farm2  farm3  farm4  farm5  farm6  farm7  farm8  farm9  farm10  farm11  farm12  farm13  farm14  farm15  - farm
	)
  (:init
        (= (cost) 0)
		(= (x farm0) 0)
		(= (x farm1) 1)
		(= (x farm2) 1)
		(= (x farm3) 0)
		(= (x farm4) 1)
		(= (x farm5) 0)
		(= (x farm6) 1)
		(= (x farm7) 1)
		(= (x farm8) 14)
		(= (x farm9) 0)
		(= (x farm10) 0)
		(= (x farm11) 0)
		(= (x farm12) 1)
		(= (x farm13) 1)
		(= (x farm14) 1)
		(= (x farm15) 0)
		
		(adj farm0 farm1)
		(adj farm0 farm2)
		(adj farm0 farm3)
		(adj farm0 farm4)
		(adj farm0 farm5)
		(adj farm0 farm6)
		(adj farm0 farm7)
		(adj farm0 farm8)
		(adj farm0 farm9)
		(adj farm0 farm10)
		(adj farm0 farm11)
		(adj farm0 farm12)
		(adj farm0 farm13)
		(adj farm0 farm14)
		(adj farm0 farm15)
		(adj farm1 farm0)
		(adj farm2 farm0)
		(adj farm3 farm0)
		(adj farm4 farm0)
		(adj farm5 farm0)
		(adj farm6 farm0)
		(adj farm7 farm0)
		(adj farm8 farm0)
		(adj farm9 farm0)
		(adj farm10 farm0)
		(adj farm11 farm0)
		(adj farm12 farm0)
		(adj farm13 farm0)
		(adj farm14 farm0)
		(adj farm15 farm0)
		
	)
	(:goal
		(and
			(>= (x farm0) 1)
			(>= (x farm1) 1)
			(>= (x farm2) 1)
			(>= (x farm3) 1)
			(>= (x farm4) 1)
			(>= (x farm5) 1)
			(>= (x farm6) 1)
			(>= (x farm7) 1)
			(>= (x farm8) 1)
			(>= (x farm9) 1)
			(>= (x farm10) 1)
			(>= (x farm11) 1)
			(>= (x farm12) 1)
			(>= (x farm13) 1)
			(>= (x farm14) 1)
			(>= (x farm15) 1)
			
			(>= (+ (* 1.6 (x farm0))(+ (* 1.9 (x farm1))(+ (* 1.1 (x farm2))(+ (* 1.3 (x farm3))(+ (* 1.4 (x farm4))(+ (* 1.8 (x farm5))(+ (* 1.7 (x farm6))(+ (* 1.1 (x farm7))(+ (* 1.0 (x farm8))(+ (* 1.5 (x farm9))(+ (* 1.5 (x farm10))(+ (* 1.5 (x farm11))(+ (* 1.6 (x farm12))(+ (* 1.5 (x farm13))(+ (* 1.1 (x farm14))(+ (* 1.2 (x farm15)) 0)))))))))))))))) 19.599999999999998)
		)
	)
)

; plan
1. (move-fast farm8 farm0)
   changed: (x farm8) from 14 to 10, (x farm0) from 0 to 2, (cost) from 0 to 1
   goals met: 11 of 17
2. (move-slow farm0 farm10)
   changed: (x farm0) from 2 to 1, (x farm10) from 0 to 1
   goals met: 12 of 17
3. (move-slow farm0 farm5)
   changed: (x farm0) from 1 to 0, (x farm5) from 0 to 1
   goals met: 12 of 17
4. (move-fast farm8 farm0)
   changed: (x farm8) from 10 to 6, (x farm0) from 0 to 2, (cost) from 1 to 2
   goals met: 13 of 17
5. (move-slow farm0 farm11)
   changed: (x farm0) from 2 to 1, (x farm11) from 0 to 1
   goals met: 14 of 17
6. (move-slow farm0 farm3)
   changed: (x farm0) from 1 to 0, (x farm3) from 0 to 1
   goals met: 14 of 17
7. (move-fast farm8 farm0)
   changed: (x farm8) from 6 to 2, (x farm0) from 0 to 2, (cost) from 2 to 3
   goals met: 15 of 17
8. (move-slow farm0 farm9)
   changed: (x farm0) from 2 to 1, (x farm9) from 0 to 1
   goals met: 16 of 17
9. (move-slow farm0 farm15)
   changed: (x farm0) from 1 to 0, (x farm15) from 0 to 1
   goals met: 16 of 17
10. (move-slow farm8 farm0)
   changed: (x farm8) from 2 to 1, (x farm0) from 0 to 1
   goals met: 17 of 17
